import { ComponentProps } from "react";
import Link from "next/link";
import { twMerge } from "tailwind-merge";

const Logo = ({ demo = true, ...props }: {
    width?: number;
    height?: number;
    className?: string;
    id?: string;
    withoutText?: boolean,
    demo?: boolean,
    href?: string
}) => {
    const { className = "", id = "gradient-color" } = props;

    return (
        <Link href={props.href || '/'} className={twMerge('relative flex items-center text-white justify-start gap-2', className)}>
            <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 920 920"
                width={'60'}
                height='60'
                className='rounded-full overflow-hidden'
                {...props}
            >
                <path
                    d="M746 9.4H164.1C73.6 9.4-.4 83.5-.4 174v581.9c0 90.5 74 164.6 164.5 164.6H746c90.6 0 164.6-74.1 164.6-164.6V174c0-90.5-74-164.6-164.6-164.6z"
                    fill="var(--primary)"
                />
                <path
                    fill="currentColor"
                    d="M225 486.4c-6.2-21.3-9.2-43.3-9.2-65.3 0-59.5 22.7-119 68-164.3 45.4-45.3 104.9-68.1 164.3-68.1 59.4 0 118.9 22.8 164.2 68.1 45.4 45.3 68.1 104.9 68.1 164.3 0 22-3.1 44-9.3 65.3-2.1 7-7.3 12.1-14.4 13.9-7.1 1.8-14.1-.1-19.3-5.3l-1.4-1.3c-5.3-5.4-7.2-12.7-5.1-19.9 4.9-17.2 7.4-35 7.4-52.7 0-48.7-18.6-97.5-55.7-134.6-37.2-37-85.9-55.6-134.5-55.6-48.7 0-97.3 18.6-134.5 55.6-37.2 37.2-55.7 85.9-55.7 134.6 0 17.7 2.5 35.4 7.4 52.7 2.1 7.2.3 14.5-5.2 19.9l-1.3 1.3c-5.2 5.2-12.2 7.1-19.4 5.3-7.1-1.9-12.3-6.9-14.4-13.9zm358.1 128.3L462.4 735.4c-7.9 7.9-20.7 7.8-28.6 0L313.1 614.7c-7.9-8-7.9-20.7 0-28.6l1.1-1.2c7.9-7.9 20.7-7.9 28.6 0l90.9 90.9c7.8 7.8 20.8 7.8 28.6 0l90.9-90.9c7.8-7.9 20.7-7.9 28.6 0l1.1 1.2c7.9 7.8 7.9 20.6 0 28.6z"
                />
                <path
                    fill="currentColor"
                    d="M217.6 579.1l216.2-216.2c7.8-7.9 20.7-7.9 28.6 0l216.2 216.2c7.8 7.8 7.8 20.8 0 28.6l-1.2 1.2c-7.9 7.9-20.8 7.9-28.6 0L462.5 422.5c-7.9-7.9-20.8-7.9-28.6 0L247.5 608.9c-7.8 7.9-20.7 7.9-28.6 0l-1.1-1.2c-7.9-7.8-7.9-20.8 0-28.6z"
                />
                <path
                    fill="currentColor"
                    d="M413.9 504.9h19.5c5.1 0 9.1 4 9.1 9v19.6c0 5-4 9.1-9.1 9.1h-19.5c-5 0-9.1-4.1-9.1-9.1v-19.6c0-5 4.1-9 9.1-9zm48.8 48.3h19.6c5 0 9 4.1 9 9.1v19.6c0 5-4 9-9 9h-19.6c-5 0-9-4-9-9v-19.6c0-5 4-9.1 9-9.1zm-48.8 0h19.5c5.1 0 9.1 4.1 9.1 9.1v19.6c0 5-4 9-9.1 9h-19.5c-5 0-9.1-4-9.1-9v-19.6c0-5 4.1-9.1 9.1-9.1zm48.8-48.3h19.6c5 0 9 4 9 9v19.6c0 5-4 9.1-9 9.1h-19.6c-5 0-9-4.1-9-9.1v-19.6c0-5 4-9 9-9z"
                />
            </svg>
            <p className="text-black font-bold text-xl">سازه من</p>
        </Link>
    );
};


export default Logo;
